zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_gpio.c
#define GPIO_NUMBER           (16U)

#define GPIO_CIDCFGR_OFFSET                    0x02u   /*offset between GPIOx_CIDCFG#i GPIOx_CIDCFG#(i+1) registers */
#define GPIO_SEMCFGR_OFFSET                    0x02u   /*offset between GPIOx_SEMCFG#i GPIOx_SEMCFG#(i+1) registers */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @addtogroup GPIO_Exported_Functions
  * @{
  */

/** @addtogroup GPIO_Exported_Functions_Group1
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the GPIOx peripheral according to the specified parameters in the GPIO_Init.
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Init: pointer to a GPIO_InitTypeDef structure that contains
  *         the configuration information for the specified GPIO peripheral.
  *         Note that EXTI instance (EXTI1/EXTI2) to use in case of interruption mode is part of
  *         GPIO_Init value (see mode field)
  * @retval None
  */
void HAL_GPIO_Init(GPIO_TypeDef  *GPIOx, const GPIO_InitTypeDef *GPIO_Init)
{
  uint32_t position = 0x00u;
  uint32_t iocurrent;
  uint32_t temp;
  uint32_t extiRequested = 0;
  EXTI_TypeDef *EXTI = NULL ;
  EXTI_Core_TypeDef *EXTI_CurrentCPU = NULL;

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Init->Pin));
  assert_param(IS_GPIO_MODE(GPIO_Init->Mode));
  assert_param(IS_GPIO_PULL(GPIO_Init->Pull));


  /* Configure the port pins */
  while (((GPIO_Init->Pin) >> position) != 0x00u)
  {
    /* Get current io position */
    iocurrent = (GPIO_Init->Pin) & (1uL << position);

    if (iocurrent != 0x00u)
    {
      /*--------------------- GPIO Mode Configuration ------------------------*/
      /* In case of Alternate function mode selection */
      if ((GPIO_Init->Mode == GPIO_MODE_AF_PP) || (GPIO_Init->Mode == GPIO_MODE_AF_OD))
      {
        /* Check the Alternate function parameters */
        assert_param(IS_GPIO_AF(GPIO_Init->Alternate));

        /* Configure Alternate function mapped with the current IO */
        temp = GPIOx->AFR[position >> 3U];
        temp &= ~(GPIO_AFRL_AFSEL0 << ((position & 0x07U) * GPIO_AFRL_AFSEL1_Pos));
        temp |= ((GPIO_Init->Alternate) << ((position & 0x07U) * GPIO_AFRL_AFSEL1_Pos));
        GPIOx->AFR[position >> 3u] = temp;
      }

      /* Configure IO Direction mode (Input, Output, Alternate or Analog) */
      temp = GPIOx->MODER;
      temp &= ~(GPIO_MODER_MODE0 << (position * GPIO_MODER_MODE1_Pos));
      temp |= ((GPIO_Init->Mode & GPIO_MODE) << (position * GPIO_MODER_MODE1_Pos));
      GPIOx->MODER = temp;

      /* In case of Output or Alternate function mode selection */
      if ((GPIO_Init->Mode == GPIO_MODE_OUTPUT_PP) || (GPIO_Init->Mode == GPIO_MODE_AF_PP) ||
          (GPIO_Init->Mode == GPIO_MODE_OUTPUT_OD) || (GPIO_Init->Mode == GPIO_MODE_AF_OD))
      {
        /* Check the Speed parameter */
        assert_param(IS_GPIO_SPEED(GPIO_Init->Speed));
        /* Configure the IO Speed */
        temp = GPIOx->OSPEEDR;
        temp &= ~(GPIO_OSPEEDR_OSPEED0 << (position * GPIO_OSPEEDR_OSPEED1_Pos));
        temp |= (GPIO_Init->Speed << (position * GPIO_OSPEEDR_OSPEED1_Pos));
        GPIOx->OSPEEDR = temp;

        /* Configure the IO Output Type */
        temp = GPIOx->OTYPER;
        temp &= ~(GPIO_OTYPER_OT0 << position) ;
        temp |= (((GPIO_Init->Mode & GPIO_OUTPUT_TYPE) >> 4U) << position);
        GPIOx->OTYPER = temp;
      }

      /* Activate the Pull-up or Pull down resistor for the current IO */
      temp = GPIOx->PUPDR;
      temp &= ~(GPIO_PUPDR_PUPD0 << (position * GPIO_PUPDR_PUPD1_Pos));
      temp |= ((GPIO_Init->Pull) << (position * GPIO_PUPDR_PUPD1_Pos));
      GPIOx->PUPDR = temp;

      /*--------------------- EXTI Mode Configuration ------------------------*/
      /* Configure the External Interrupt or event for the current IO */
#if !defined(CORE_CM0PLUS)
      if ((GPIO_Init->Mode & EXTI1_MODE) == EXTI1_MODE)
      {
        extiRequested = 1;
        EXTI = EXTI1;
#if defined(CORE_CM33)
        EXTI_CurrentCPU = EXTI1_C2; /* GPIOs are connected to M33 NVIC via connection 2*/
#endif  /* CORE_CM33 */
#if defined(CORE_CA35)
        EXTI_CurrentCPU = EXTI1_C1; /* GPIOs are connected to A35 GIC via connection 1*/
#endif  /* CORE_CA35 */
      }
#endif  /* !defined(CORE_CM0PLUS) */
      if ((GPIO_Init->Mode & EXTI2_MODE) == EXTI2_MODE)
      {
        extiRequested = 1;
        EXTI = EXTI2;
#if defined(CORE_CM0PLUS)
        EXTI_CurrentCPU = EXTI2_C3; /* GPIOs are connected to CM0PLUS NVIC via connection 3*/
#endif  /* CORE_CM0PLUS */
#if defined(CORE_CM33)
        EXTI_CurrentCPU = EXTI2_C2; /* GPIOs are connected to M33 NVIC via connection 2*/
#endif  /* CORE_CM33 */
#if defined(CORE_CA35)
        EXTI_CurrentCPU = EXTI2_C1; /* GPIOs are connected to A35 GIC via connection 1*/
#endif  /* CORE_CA35 */
      }


      if (extiRequested != 0U)
      {
        temp = EXTI->EXTICR[position >> 2u];
        temp &= ~(EXTI_EXTICR1_EXTI0 << (EXTI_EXTICR1_EXTI1_Pos * (position & 0x03U)));
        temp |= ((uint32_t)GPIO_GET_INDEX(GPIOx) << (EXTI_EXTICR1_EXTI1_Pos * (position & 0x03U)));
        EXTI->EXTICR[position >> 2u] = temp;

        /* Clear Rising Falling edge configuration */
        temp = EXTI->RTSR1;
        temp &= ~((uint32_t)iocurrent);
        if ((GPIO_Init->Mode & RISING_EDGE) == RISING_EDGE)
        {
          temp |= iocurrent;
        }
        EXTI->RTSR1 = temp;

