zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_gpio.c
        temp = EXTI->FTSR1;
        temp &= ~((uint32_t)iocurrent);
        if ((GPIO_Init->Mode & FALLING_EDGE) == FALLING_EDGE)
        {
          temp |= iocurrent;
        }
        EXTI->FTSR1 = temp;

        /* Clear EXTI line configuration */
        temp = EXTI_CurrentCPU->IMR1;
        temp &= ~((uint32_t)iocurrent);
        if ((GPIO_Init->Mode & GPIO_MODE_IT) == GPIO_MODE_IT)
        {
          temp |= iocurrent;
        }
        EXTI_CurrentCPU->IMR1 = temp;

        temp = EXTI_CurrentCPU->EMR1;
        temp &= ~((uint32_t)iocurrent);
        if ((GPIO_Init->Mode & GPIO_MODE_EVT) == GPIO_MODE_EVT)
        {
          temp |= iocurrent;
        }
        EXTI_CurrentCPU->EMR1 = temp;
      }
    }

    position++;
  }
}

#if !defined(CORE_CM0PLUS)
EXTI_TypeDef *getUsedExti(const GPIO_TypeDef  *GPIOx, uint32_t pinPosition)
{
#define EXTI_INSTANCE_NB 2U
  uint32_t extiIndex;
  uint32_t portIndex;
  uint32_t GPIOx_index = 0xFF;
  const EXTI_TypeDef  *instanceEXTI;
  const EXTI_TypeDef *instanceTab[]  = {EXTI1, EXTI2};
  uint32_t temp;
#if defined(GPIOJ) && defined(GPIOK)
  const GPIO_TypeDef *port[] = {GPIOA, GPIOB, GPIOC, GPIOD, GPIOE, GPIOF, GPIOG, GPIOH, GPIOI, GPIOJ, GPIOK, GPIOZ};
#else   /* defined(GPIOJ) && defined(GPIOK) */
  const GPIO_TypeDef *port[] = {GPIOA, GPIOB, GPIOC, GPIOD, GPIOE, GPIOF, GPIOG, GPIOH, GPIOI, GPIOZ};
#endif  /* defined(GPIOJ) && defined(GPIOK) */
  const EXTI_Core_TypeDef *EXTI_CurrentCPU;


#if defined(CORE_CM33)
  const EXTI_Core_TypeDef *EXTI_CPU[]  = {EXTI1_C2, EXTI2_C2};
#endif  /* CORE_CM33 */
#if defined(CORE_CA35)
  const EXTI_Core_TypeDef *EXTI_CPU[]  = {EXTI1_C1, EXTI2_C1};
#endif  /* CORE_CA35 */

  /* find port index */
  for (portIndex = 0; portIndex < (sizeof(port) / sizeof(GPIO_TypeDef *)); portIndex++)
  {
    if (GPIOx == port[portIndex])
    {
      GPIOx_index = portIndex;
      break;
    }
  }

  /*parse all EXTI instance*/
  for (extiIndex = 0; extiIndex < EXTI_INSTANCE_NB; extiIndex++)
  {
    EXTI_CurrentCPU = EXTI_CPU[extiIndex];

    /*check if parsed EXTI instance is configured for a connection with input param GPIO bank*/
    instanceEXTI = instanceTab[extiIndex];
    temp = instanceEXTI->EXTICR[pinPosition >> 2u];
    if (((temp >> ((pinPosition % 4U) * EXTI_EXTICR1_EXTI1_Pos)) & EXTI_EXTICR1_EXTI0) == GPIOx_index)
    {
      /*check if interruption mode is selected for input pin*/
      if ((((EXTI_CurrentCPU->IMR1) >> pinPosition) & 0x1U) != 0U)
      {
        return (EXTI_TypeDef *)instanceEXTI;  /* both GPIO bank and interruption mode are OK */
      }
      /*check if event mode is selected for input pin*/
      if ((((EXTI_CurrentCPU->EMR1) >> pinPosition) & 0x1U) != 0U)
      {
        return (EXTI_TypeDef *)instanceEXTI;  /* both GPIO bank and event mode are OK */
      }
    }
  }
  return NULL;  /* EXTI instance not founded */
}
#endif /*!defined(CORE_CM0PLUS)*/

/**
  * @brief  De-initializes the GPIOx peripheral registers to their default reset values.
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin: specifies the port bit to be written.
  *         This parameter is a bit mask where  2**k is bit mask of GPIO line k
  * @retval None
  */
void HAL_GPIO_DeInit(GPIO_TypeDef  *GPIOx, uint32_t GPIO_Pin)
{
  uint32_t position = 0x00uL;
  uint32_t iocurrent;
  uint32_t tmp;
  EXTI_TypeDef *EXTI;
  EXTI_Core_TypeDef *EXTI_CurrentCPU;

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));


  /* Configure the port pins */
  while ((GPIO_Pin >> position) != 0x00u)
  {
    /* Get current io position */
    iocurrent = (GPIO_Pin) & (1uL << position);

    if (iocurrent != 0x00u)
    {
      /*------------------------- EXTI Mode Configuration --------------------*/
      /* Clear the External Interrupt or Event for the current IO */
      {
#if defined(CORE_CM0PLUS)
        EXTI = EXTI2;
        EXTI_CurrentCPU = EXTI2_C3;
#else   /* CORE_CM0PLUS */
        EXTI = getUsedExti(GPIOx, position);
#if defined(CORE_CM33)
        EXTI_CurrentCPU = (EXTI == EXTI2) ? (EXTI2_C2) : (EXTI1_C2);
#endif  /* CORE_CM33 */
#if defined(CORE_CA35)
        EXTI_CurrentCPU = (EXTI == EXTI2) ? (EXTI2_C1) : (EXTI1_C1);
#endif  /* CORE_CA35 */
#endif  /* CORE_CM0PLUS */
        if (EXTI != NULL)
        {
          tmp = EXTI->EXTICR[position >> 2u];
          tmp &= ((uint32_t)EXTI_EXTICR1_EXTI0 << (EXTI_EXTICR1_EXTI1_Pos  * (position & 0x03UL)));
          if (tmp == ((uint32_t)GPIO_GET_INDEX(GPIOx) << (EXTI_EXTICR1_EXTI1_Pos * (position & 0x03UL))))
          {
            /* Clear EXTI line configuration */
            /* Clear the External Interrupt or Event for the current IO */
            EXTI_CurrentCPU->IMR1 &= ~((uint32_t)iocurrent);
            EXTI_CurrentCPU->EMR1 &= ~((uint32_t)iocurrent);

            /* Clear Rising Falling edge configuration */
            EXTI->RTSR1 &= ~(iocurrent);
            EXTI->FTSR1 &= ~(iocurrent);

            /* Clear EXTICR configuration */
            tmp = (uint32_t)EXTI_EXTICR1_EXTI0 << (EXTI_EXTICR1_EXTI1_Pos * (position & 0x03U));
            EXTI->EXTICR[position >> 2u] &= ~tmp;
          }
        }
      }

      /*------------------------- GPIO Mode Configuration --------------------*/
      /* Configure IO in Analog Mode */
      GPIOx->MODER |= ((uint32_t)GPIO_MODER_MODE0 << (position * GPIO_MODER_MODE1_Pos));

      /* Configure the default Alternate Function in current IO */
      GPIOx->AFR[position >> 3U] &= ~(GPIO_AFRL_AFSEL0 << ((position & 0x07U) * GPIO_AFRL_AFSEL1_Pos)) ;

      /* Configure the default value for IO Speed */
      GPIOx->OSPEEDR &= ~(GPIO_OSPEEDR_OSPEED0 << (position * GPIO_OSPEEDR_OSPEED1_Pos));

      /* Configure the default value IO Output Type */
      GPIOx->OTYPER  &= ~(GPIO_OTYPER_OT0 << position) ;

      /* Deactivate the Pull-up and Pull-down resistor for the current IO */
      GPIOx->PUPDR &= ~(GPIO_PUPDR_PUPD0 << (position * GPIO_PUPDR_PUPD1_Pos));
    }
    position++;
  }
}

/**
  * @}
  */

/** @addtogroup GPIO_Exported_Functions_Group2
  *  @brief GPIO Read, Write, Toggle, Lock and EXTI management functions.
  *
@verbatim
 ===============================================================================
                       ##### IO operation functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Read the specified input port pin.
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin specifies the port bit to read.
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval The input port pin value.
  */
GPIO_PinState HAL_GPIO_ReadPin(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin)
{
  GPIO_PinState bitstatus;

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));

  if ((GPIOx->IDR & GPIO_Pin) != 0x00u)
  {
    bitstatus = GPIO_PIN_SET;
  }
  else
  {
    bitstatus = GPIO_PIN_RESET;
  }
  return bitstatus;
}

/**
  * @brief  Set or clear the selected data port bit.
  *
  * @note   This function uses GPIOx_BSRR register to allow atomic read/modify
  *         accesses. In this way, there is no risk of an IRQ occurring between
  *         the read and the modify access.
  *
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin specifies the port bit to be written.
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @param PinState specifies the value to be written to the selected bit.
  *         This parameter can be one of the GPIO_PinState enum values:
  *            @arg GPIO_PIN_RESET: to clear the port pin
  *            @arg GPIO_PIN_SET: to set the port pin
  * @retval None
  */
void HAL_GPIO_WritePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  assert_param(IS_GPIO_PIN_ACTION(PinState));

  if (PinState != GPIO_PIN_RESET)
  {
    GPIOx->BSRR = (uint32_t)GPIO_Pin;
  }
  else
  {
    GPIOx->BSRR = (uint32_t)GPIO_Pin << GPIO_NUMBER;
  }
}

/**
  * @brief  Set and clear several pins of a dedicated port in same cycle.
  * @note   This function uses GPIOx_BSRR and GPIOx_BRR registers to allow atomic read/modify
  *         accesses.
  * @param  GPIOx where x can be any bank of GPIO peripheral for STM32MP2xx family
  * @param  PinReset specifies the port bits to be reset
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15) or zero.
  * @param  PinSet specifies the port bits to be set
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15) or zero.
  * @note   Both PinReset and PinSet combinations shall not get any common bit, else
  *         assert would be triggered.
  * @note   At least one of the two parameters used to set or reset shall be different from zero.
  * @retval None
  */
void HAL_GPIO_WriteMultipleStatePin(GPIO_TypeDef *GPIOx, uint16_t PinReset, uint16_t PinSet)
{
  uint32_t tmp;

  /* Check the parameters */
  /* Make sure at least one parameter is different from zero and that there is no common pin */
  assert_param(IS_GPIO_PIN((uint32_t)PinReset | (uint32_t)PinSet));
  assert_param(IS_GPIO_COMMON_PIN(PinReset, PinSet));

  tmp = (((uint32_t)PinReset << 16) | PinSet);
  GPIOx->BSRR = tmp;
}

/**
  * @brief  Toggle the specified GPIO pin.
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin specifies the pin to be toggled.
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15).
  * @retval None
  */
void HAL_GPIO_TogglePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));

  if ((GPIOx->ODR & GPIO_Pin) != 0x00u)
  {
    GPIOx->BRR = (uint32_t)GPIO_Pin;
  }
  else
  {
    GPIOx->BSRR = (uint32_t)GPIO_Pin;
  }
}

/**
  * @brief  Lock GPIO Pins configuration registers.
  * @note   The locked registers are GPIOx_MODER, GPIOx_OTYPER, GPIOx_OSPEEDR,
  *         GPIOx_PUPDR, GPIOx_AFRL and GPIOx_AFRH.
  * @note   The configuration of the locked GPIO pins can no longer be modified
  *         until the next reset.
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin specifies the port bits to be locked.
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15).
  * @retval None
  */
HAL_StatusTypeDef HAL_GPIO_LockPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin)
{
  __IO uint32_t tmp = GPIO_LCKR_LCKK;

  /* Check the parameters */
  assert_param(IS_GPIO_LOCK_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));

  /* Apply lock key write sequence */
  tmp |= GPIO_Pin;
  /* Set LCKx bit(s): LCKK='1' + LCK[15-0] */
  GPIOx->LCKR = tmp;
  /* Reset LCKx bit(s): LCKK='0' + LCK[15-0] */
  GPIOx->LCKR = GPIO_Pin;
  /* Set LCKx bit(s): LCKK='1' + LCK[15-0] */
  GPIOx->LCKR = tmp;
  /* Read LCKK register. This read is mandatory to complete key lock sequence */
  tmp = GPIOx->LCKR;

  /* read again in order to confirm lock is active */
  if ((GPIOx->LCKR & GPIO_LCKR_LCKK) != 0x00u)
  {
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @brief  Handle EXTI interrupt request.
  * @param GPIO_Pin Specifies the port pin connected to corresponding EXTI line.
  * @retval None
  */
#if !defined(CORE_CM0PLUS)
void HAL_GPIO_EXTI1_IRQHandler(uint16_t GPIO_Pin)
{
  /* EXTI line interrupt detected */
  if (__HAL_GPIO_EXTI1_GET_RISING_IT(GPIO_Pin) != (uint32_t)RESET)
  {
    __HAL_GPIO_EXTI1_CLEAR_RISING_IT(GPIO_Pin);
    HAL_GPIO_EXTI1_Rising_Callback(GPIO_Pin);
  }

  if (__HAL_GPIO_EXTI1_GET_FALLING_IT(GPIO_Pin) != (uint32_t)RESET)
  {
    __HAL_GPIO_EXTI1_CLEAR_FALLING_IT(GPIO_Pin);
    HAL_GPIO_EXTI1_Falling_Callback(GPIO_Pin);
  }
}
#endif /*!defined(CORE_CM0PLUS)*/

void HAL_GPIO_EXTI_IRQHandler(uint16_t GPIO_Pin)
{
  /* EXTI line interrupt detected */
  if (__HAL_GPIO_EXTI_GET_RISING_IT(GPIO_Pin) != (uint32_t)RESET)
  {
    __HAL_GPIO_EXTI_CLEAR_RISING_IT(GPIO_Pin);
    HAL_GPIO_EXTI_Rising_Callback(GPIO_Pin);
  }

  if (__HAL_GPIO_EXTI_GET_FALLING_IT(GPIO_Pin) != (uint32_t)RESET)
  {
    __HAL_GPIO_EXTI_CLEAR_FALLING_IT(GPIO_Pin);
    HAL_GPIO_EXTI_Falling_Callback(GPIO_Pin);
  }
}

/**
  * @brief  EXTI line rising detection callback.
  * @param GPIO_Pin Specifies the port pin connected to corresponding EXTI line.
  * @retval None
  */
__weak void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(GPIO_Pin);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_GPIO_EXTI_Rising_Callback could be implemented in the user file
   */
}
#if !defined(CORE_CM0PLUS)
__weak void HAL_GPIO_EXTI1_Rising_Callback(uint16_t GPIO_Pin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(GPIO_Pin);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_GPIO_EXTI_Rising_Callback could be implemented in the user file
   */
}
#endif /*!defined(CORE_CM0PLUS)*/


/**
  * @brief  EXTI line falling detection callback.
  * @param  GPIO_Pin Specifies the port pin connected to corresponding EXTI line.
  * @retval None
  */
__weak void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(GPIO_Pin);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_GPIO_EXTI_Falling_Callback could be implemented in the user file
   */
}
#if !defined(CORE_CM0PLUS)
__weak void HAL_GPIO_EXTI1_Falling_Callback(uint16_t GPIO_Pin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(GPIO_Pin);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_GPIO_EXTI_Rising_Callback could be implemented in the user file
   */
}
#endif /*!defined(CORE_CM0PLUS)*/
/**
  * @}
  */


/**
  * @brief  Configure RIF attribute of a GPIO pin bitmap.
  *         Available RIF attributes are CID, security and privilege protection.
  *         RIF attribute is applied on all pins of input param bitmap.
  * @note   If no CID attribute provide, CID filtering is disabled.
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin : gpio pin bitmap.
  * @param  PinAttributes: RIF (CID/secure/privilege) attributes.

  * @retval HAL Status.

  */
HAL_StatusTypeDef HAL_GPIO_ConfigPinAttributes(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, uint32_t PinAttributes)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  __IO uint32_t *regaddr;


  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  assert_param(IS_GPIO_PIN_ATTRIBUTES(PinAttributes));

  /* Configure the port pins */
  while ((GPIO_Pin >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = GPIO_Pin & (1uL << position);
    if (iocurrent != 0U)
    {
#if defined (CORTEX_IN_SECURE_STATE)
      if ((PinAttributes & GPIO_PIN_ATTR_SEC_SELECT) == GPIO_PIN_ATTR_SEC_SELECT)
      {
        /* Configure secure/non-secure attribute */
        if ((PinAttributes & GPIO_PIN_SEC) == GPIO_PIN_SEC)
        {
          GPIOx->SECCFGR |= iocurrent;
        }
        else
        {
          GPIOx->SECCFGR &= (~iocurrent);
        }
      }
#endif  /* CORTEX_IN_SECURE_STATE */
      if ((PinAttributes & GPIO_PIN_ATTR_PRIV_SELECT) == GPIO_PIN_ATTR_PRIV_SELECT)
      {
        /* Configure privilege/non-privilege attribute */
        if ((PinAttributes & GPIO_PIN_PRIV) == GPIO_PIN_PRIV)
        {
          GPIOx->PRIVCFGR |= iocurrent;
        }
        else
        {
          GPIOx->PRIVCFGR &= (~iocurrent);
        }
      }
      regaddr = &GPIOx->CIDCFGR0 + (GPIO_CIDCFGR_OFFSET * position);
      *regaddr = 0;  /*remove any CID filtering on selected pin*/
      if ((PinAttributes & (GPIO_PIN_CID_DISABLE | GPIO_PIN_ATTR_CID_STATIC_SELECT)) == GPIO_PIN_ATTR_CID_STATIC_SELECT)
        /*static CID field value used ONLY is CID filtering not disable */
      {
        /* Write static CID configuration */
        *regaddr = ((PinAttributes & GPIO_CIDCFGR0_SCID_Msk) | GPIO_CIDCFGR0_CFEN);
      }
      if ((PinAttributes & (GPIO_PIN_CID_DISABLE | GPIO_PIN_ATTR_CID_SHARED_SELECT)) == GPIO_PIN_ATTR_CID_SHARED_SELECT)
        /*shared CID field value used ONLY is CID filtering not disable */
      {
        /* Write shared CID configuration */
        *regaddr = ((PinAttributes & GPIO_PIN_ATTR_CID_SHARED_MASK) | GPIO_CIDCFGR0_SEM_EN | GPIO_CIDCFGR0_CFEN);
      }
    }
    position++;
  }
  return HAL_OK;
}


/**
  * @brief  Get a RIF attributes a single GPIO pin.
  * @note   In case input bitmap selects several pins, RIF attributes of first low rank pin is returned
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin : gpio pin bitmap, should select only ONE pin
  * @param  pPinAttributes: pointer of  RIF attributes.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_GPIO_GetConfigPinAttributes(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin,
                                                  uint32_t *pPinAttributes)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  __I uint32_t *regaddr;

  /* Check null pointer */
  if (pPinAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin) && (GPIO_Pin != GPIO_PIN_ALL));
  *pPinAttributes = 0;

  /* Get secure attribute of the port pin */
  while ((GPIO_Pin >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = (GPIO_Pin & (1UL << position));

    if (iocurrent != 0U)
    {
#if defined (CORTEX_IN_SECURE_STATE)
      *pPinAttributes |= ((GPIOx->SECCFGR & iocurrent) == 0U) ? GPIO_PIN_NSEC : GPIO_PIN_SEC;
#endif  /* CORTEX_IN_SECURE_STATE */
      *pPinAttributes |= ((GPIOx->PRIVCFGR & iocurrent) == 0U) ? GPIO_PIN_NPRIV : GPIO_PIN_PRIV;
      regaddr = &GPIOx->CIDCFGR0 + (GPIO_CIDCFGR_OFFSET * position);
      if ((*regaddr & GPIO_CIDCFGR0_CFEN_Msk) == GPIO_CIDCFGR0_CFEN)
      {
        if ((*regaddr & GPIO_CIDCFGR0_SEM_EN_Msk) == GPIO_CIDCFGR0_SEM_EN)
        {
          /* Get CIDs value from Semaphore white list */
          *pPinAttributes |= ((GPIO_PIN_ATTR_CID_SHARED_SELECT) |
                              (((*regaddr)) &
                               (GPIO_CIDCFGR0_SEMWLC3_Msk |
                                GPIO_CIDCFGR0_SEMWLC2_Msk |
                                GPIO_CIDCFGR0_SEMWLC1_Msk |
                                GPIO_CIDCFGR0_SEMWLC0_Msk)));
        }
        else
        {
          /* Get CIDs value from Static CID field and translate it in bitfield value as
           * defined by GPIO attribute definition */
          *pPinAttributes |= (GPIO_PIN_ATTR_CID_STATIC_SELECT | ((*regaddr) & GPIO_CIDCFGR0_SCID_Msk));
        }
      }
      else
      {
        *pPinAttributes |= GPIO_PIN_CID_DISABLE;
      }
      break;
    }
    position++;
  }

  return HAL_OK;
}

/**
  * @brief  Attempt to acquire semaphore(s) of  GPIO pin bitmap.
  * @note   In case of semaphore acquisition failure, returned status is HAL_KO and
  *         semaphore acquisition is abandoned  for all bitmap
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin : gpio pin bitmap
  * @retval HAL Status, HAL_OK if semaphore acquisition for all pins of GPIO_Pin is successful
  */

HAL_StatusTypeDef HAL_GPIO_TakePinSemaphore(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  uint32_t cidcurrent;
  uint32_t msk = 0x00;
  __IO uint32_t *regaddr;

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));

