zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_gpio.c
#if defined(CORE_CM0PLUS)
  cidcurrent = RIF_CID_CPU3_CM0;
#endif  /* CORE_CM0PLUS */
#if defined(CORE_CM33)
  cidcurrent = RIF_CID_CPU2_CM33;
#endif  /* CORE_CM33 */
#if defined(CORE_CA35)
  cidcurrent = RIF_CID_CPU1_CA35;
#endif  /* CORE_CA35 */
  /* Get secure attribute of the port pin */
  while ((GPIO_Pin >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = GPIO_Pin & (1UL << position);
    if (iocurrent != 0U)
    {
      /* Take Semaphore*/
      regaddr = &GPIOx->SEMCR0 + (GPIO_SEMCFGR_OFFSET * position);
      *regaddr = GPIO_SEMCR0_SEM_MUTEX;
      if (((*regaddr) & GPIO_SEMCR0_SEMCID_Msk) != (cidcurrent << GPIO_SEMCR0_SEMCID_Pos))
      {
        /* Mutex not taken with current CID - it means that other authorized CID has control,
         * all previous acquired semaphores (if any) shall be released and status error is returned */
        if ((GPIO_Pin & msk) != 0U)
        {
          (void)HAL_GPIO_ReleasePinSemaphore(GPIOx, (GPIO_Pin & (uint16_t)msk));
        }
        return HAL_ERROR;
      }
    }
    msk += (1UL << position);
    position++;
  }
  return HAL_OK;
}

/**
  * @brief  Release semaphore(s) of  GPIO pin bitmap.
  * @param  GPIOx : pointer to GPIO peripheral instance
  * @param  GPIO_Pin : gpio pin bitmap
  * @retval HAL Status, HAL_OK
  */
HAL_StatusTypeDef HAL_GPIO_ReleasePinSemaphore(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin)
{
  uint32_t position = 0x00;
  uint32_t iocurrent;
  __IO uint32_t *regaddr;

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));

  /* Get secure attribute of the port pin */
  while ((GPIO_Pin >> position) != 0U)
  {
    /* Get current io position */
    iocurrent = GPIO_Pin & (1UL << position);
    if (iocurrent != 0U)
    {
      /* Release Semaphore*/
      regaddr = (__IO uint32_t *)&GPIOx->SEMCR0 + (GPIO_SEMCFGR_OFFSET * position);
      *regaddr = ~GPIO_SEMCR0_SEM_MUTEX;
    }
    position++;
  }
  return HAL_OK;
}


/**
  * @}
  */


/**
  * @}
  */

#endif /* HAL_GPIO_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
